---
kind: type
id: T:Autodesk.Revit.DB.IFC.RoofComponents
source: html/edd1717d-fe80-067c-d5f1-4d84c6a3573b.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents

A class that contains multiple roof slab infos of a roof.

## Syntax (C#)
```csharp
public class RoofComponents : IDisposable
```

## Remarks
This class contains a series of collections that are all of the same length, and whose nth index corresponds
 to the nth slab of the roof.